## ✅ PASSED Terraform PR Validation

**Environment:** staging

<details><summary>📋 Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.infrastructure.data.aws_iam_policy_document.parameter_store_access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "parameter_store_access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ssm:GetParameter",
              + "ssm:GetParameters",
              + "ssm:GetParametersByPath",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ssm:us-east-1:*:parameter/staging/*",
            ]
          + sid       = "AllowParameterStoreRead"
        }
      + statement {
          + actions   = [
              + "kms:Decrypt",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowKMSDecrypt"
        }
    }

  # module.infrastructure.data.aws_ssm_parameter.opensearch_master_password will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ssm_parameter" "opensearch_master_password" {
      + arn             = (known after apply)
      + id              = (known after apply)
      + insecure_value  = (known after apply)
      + name            = "/staging/opensearch/master_password"
      + type            = (known after apply)
      + value           = (sensitive value)
      + version         = (known after apply)
      + with_decryption = true
    }

  # module.infrastructure.data.aws_ssm_parameter.redis_auth_token will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ssm_parameter" "redis_auth_token" {
      + arn             = (known after apply)
      + id              = (known after apply)
      + insecure_value  = (known after apply)
      + name            = "/staging/redis/auth_token"
      + type            = (known after apply)
      + value           = (sensitive value)
      + version         = (known after apply)
      + with_decryption = true
    }

  # module.infrastructure.aws_autoscaling_policy.alb_request_count will be created
  + resource "aws_autoscaling_policy" "alb_request_count" {
      + arn                     = (known after apply)
      + autoscaling_group_name  = "staging-app-asg"
      + enabled                 = true
      + id                      = (known after apply)
      + metric_aggregation_type = (known after apply)
      + name                    = "staging-app-alb-requests"
      + policy_type             = "TargetTrackingScaling"

      + target_tracking_configuration {
          + disable_scale_in = false
          + target_value     = 1000

          + predefined_metric_specification {
              + predefined_metric_type = "ALBRequestCountPerTarget"
              + resource_label         = (known after apply)
            }
        }
    }

  # module.infrastructure.aws_autoscaling_policy.cpu_target will be created
  + resource "aws_autoscaling_policy" "cpu_target" {
      + arn                     = (known after apply)
      + autoscaling_group_name  = "staging-app-asg"
      + enabled                 = true
      + id                      = (known after apply)
      + metric_aggregation_type = (known after apply)
      + name                    = "staging-app-cpu-target"
      + policy_type             = "TargetTrackingScaling"

      + target_tracking_configuration {
          + disable_scale_in = false
          + target_value     = 70

          + predefined_metric_specification {
              + predefined_metric_type = "ASGAverageCPUUtilization"
            }
        }
    }

  # module.infrastructure.aws_cloudwatch_log_group.vpc_flow_logs will be created
  + resource "aws_cloudwatch_log_group" "vpc_flow_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/vpc/staging-flow-logs"
      + name_prefix       = (known after apply)
      + retention_in_days = 365
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "staging-vpc-flow-logs"
          + "Project"     = "infrastructure-exercise"
        }
      + tags_all          = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "staging-vpc-flow-logs"
          + "Project"     = "infrastructure-exercise"
        }
    }

  # module.infrastructure.aws_flow_log.main will be created
  + resource "aws_flow_log" "main" {
      + arn                      = (known after apply)
      + iam_role_arn             = (known after apply)
      + id                       = (known after apply)
      + log_destination          = (known after apply)
      + log_destination_type     = "cloud-watch-logs"
      + log_format               = (known after apply)
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + tags                     = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "staging-vpc-flow-log"
          + "Project"     = "infrastructure-exercise"
        }
      + tags_all                 = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "staging-vpc-flow-log"
          + "Project"     = "infrastructure-exercise"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = (known after apply)
    }

  # module.infrastructure.aws_iam_policy.assume_eks_developers will be created
  + resource "aws_iam_policy" "assume_eks_developers" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allow assuming EKS Developers role"
      + id               = (known after apply)
      + name             = "staging-assume-eks-developers"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "infrastructure-exercise"
        }
    }

  # module.infrastructure.aws_iam_policy.assume_eks_devops will be created
  + resource "aws_iam_policy" "assume_eks_devops" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allow assuming EKS DevOps role"
      + id               = (known after apply)
      + name             = "staging-assume-eks-devops"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "infrastructure-exercise"
        }
    }

  # module.infrastructure.aws_iam_policy.parameter_store_access will be created
  + resource "aws_iam_policy" "parameter_store_access" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allow reading parameters from Parameter Store"
      + id               = (known after apply)
      + name             = "staging-parameter-store-access"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "infrastructure-exercise"
        }
    }

  # module.infrastructure.aws_iam_role.eks_developers will be created
  + resource "aws_iam_role" "eks_developers" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + StringEquals = {
                              + "sts:ExternalId" = "staging"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::552927148809:root"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "staging-eks-developers-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "infrastructure-exercise"
        }
      + tags_all              = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "infrastructure-exercise"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.infrastructure.aws_iam_role.eks_devops will be created
  + resource "aws_iam_role" "eks_devops" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + StringEquals = {
                              + "sts:ExternalId" = "staging"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::552927148809:root"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "staging-eks-devops-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "infrastructure-exercise"
        }
      + tags_all              = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "infrastructure-exercise"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.infrastructure.aws_iam_role.vpc_flow_logs will be created
  + resource "aws_iam_role" "vpc_flow_logs" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "vpc-flow-logs.amazonaws.com"
                        }
                      + Sid       = "VPCFlowLogsAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "staging-vpc-flow-logs-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "infrastructure-exercise"
        }
      + tags_all              = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "infrastructure-exercise"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.infrastructure.aws_iam_role_policy.vpc_flow_logs will be created
  + resource "aws_iam_role_policy" "vpc_flow_logs" {
      + id          = (known after apply)
      + name        = "staging-vpc-flow-logs-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.infrastructure.aws_security_group_rule.alb_internal_to_eks_nodes will be created
  + resource "aws_security_group_rule" "alb_internal_to_eks_nodes" {
      + description              = "Allow traffic from internal ALB to EKS nodes for pod access"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.infrastructure.aws_security_group_rule.alb_public_to_eks_nodes will be created
  + resource "aws_security_group_rule" "alb_public_to_eks_nodes" {
      + description              = "Allow traffic from public ALB to EKS nodes for pod access"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.infrastructure.aws_security_group_rule.cluster_ingress_nodes will be created
  + resource "aws_security_group_rule" "cluster_ingress_nodes" {
      + description              = "Allow nodes to communicate with cluster API"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.infrastructure.aws_wafv2_web_acl_association.public_alb will be created
  + resource "aws_wafv2_web_acl_association" "public_alb" {
      + id           = (known after apply)
      + resource_arn = (known after apply)
      + web_acl_arn  = (known after apply)
    }

  # module.infrastructure.kubernetes_config_map_v1_data.aws_auth will be created
  + resource "kubernetes_config_map_v1_data" "aws_auth" {
      + data          = (known after apply)
      + field_manager = "Terraform"
      + force         = true
      + id            = (known after apply)

      + metadata {
          + name      = "aws-auth"
          + namespace = "kube-system"
        }
    }

  # module.infrastructure.random_password.db_password will be created
  + resource "random_password" "db_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # module.infrastructure.random_password.opensearch_master_password will be created
  + resource "random_password" "opensearch_master_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # module.infrastructure.random_password.redis_auth_token will be created
  + resource "random_password" "redis_auth_token" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 32
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "!&#$^<>-"
      + result           = (sensitive value)
      + special          = false
      + upper            = true
    }

  # module.infrastructure.module.alb_internal.aws_lb.this will be created
  + resource "aws_lb" "this" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = true
      + enable_deletion_protection                                   = true
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = true
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "staging-internal-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags                                                         = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "staging-internal-alb"
          + "Project"     = "infrastructure-exercise"
          + "Type"        = "internal"
        }
      + tags_all                                                     = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "staging-internal-alb"
          + "Project"     = "infrastructure-exercise"
          + "Type"        = "internal"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + subnet_mapping (known after apply)
    }

  # module.infrastructure.module.alb_internal.aws_lb_listener.http will be created
  + resource "aws_lb_listener" "http" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags                                                                  = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "infrastructure-exercise"
          + "Type"        = "internal"
        }
      + tags_all                                                              = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "infrastructure-exercise"
          + "Type"        = "internal"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

  # module.infrastructure.module.alb_internal.aws_lb_target_group.this["ec2"] will be created
  + resource "aws_lb_target_group" "this" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "staging-internal-alb-ec2-tg"
      + name_prefix                        = (known after apply)
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "staging-internal-alb-ec2-tg"
          + "Project"     = "infrastructure-exercise"
          + "Type"        = "internal"
        }
      + tags_all                           = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "staging-internal-alb-ec2-tg"
          + "Project"     = "infrastructure-exercise"
          + "Type"        = "internal"
        }
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "200"
          + path                = "/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # module.infrastructure.module.alb_public.aws_lb.this will be created
  + resource "aws_lb" "this" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = true
      + enable_deletion_protection                                   = true
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "staging-public-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags                                                         = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "staging-public-alb"
          + "Project"     = "infrastructure-exercise"
          + "Type"        = "public"
        }
      + tags_all                                                     = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "staging-public-alb"
          + "Project"     = "infrastructure-exercise"
          + "Type"        = "public"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + subnet_mapping (known after apply)
    }

  # module.infrastructure.module.alb_public.aws_lb_listener.http will be created
  + resource "aws_lb_listener" "http" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags                                                                  = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "infrastructure-exercise"
          + "Type"        = "public"
        }
      + tags_all                                                              = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "infrastructure-exercise"
          + "Type"        = "public"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

  # module.infrastructure.module.alb_public.aws_lb_target_group.this["ec2"] will be created
  + resource "aws_lb_target_group" "this" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "staging-public-alb-ec2-tg"
      + name_prefix                        = (known after apply)
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "staging-public-alb-ec2-tg"
          + "Project"     = "infrastructure-exercise"
          + "Type"        = "public"
        }
      + tags_all                           = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "staging-public-alb-ec2-tg"
          + "Project"     = "infrastructure-exercise"
          + "Type"        = "public"
        }
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "200"
          + path                = "/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # module.infrastructure.module.ec2_app.aws_autoscaling_group.this will be created
  + resource "aws_autoscaling_group" "this" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 2
      + enabled_metrics                  = [
          + "GroupDesiredCapacity",
          + "GroupInServiceInstances",
          + "GroupMaxSize",
          + "GroupMinSize",
          + "GroupTotalInstances",
        ]
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = "EC2"
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 4
      + metrics_granularity              = "1Minute"
      + min_size                         = 1
      + name                             = "staging-app-asg"
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + vpc_zone_identifier              = (known after apply)
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + availability_zone_distribution (known after apply)

      + capacity_reservation_specification (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + mixed_instances_policy (known after apply)

      + tag {
          + key                 = "Environment"
          + propagate_at_launch = true
          + value               = "staging"
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "staging-app"
        }
      + tag {
          + key                 = "Purpose"
          + propagate_at_launch = true
          + value               = "application"
        }

      + traffic_source (known after apply)
    }

  # module.infrastructure.module.ec2_app.aws_launch_template.this will be created
  + resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = "ami-057a9f77fd28e08c5"
      + instance_type          = "t3.medium"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "staging-app-lt-"
      + tags_all               = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "infrastructure-exercise"
        }
      + vpc_security_group_ids = (known after apply)

      + block_device_mappings {
          + device_name = "/dev/xvda"

          + ebs {
              + delete_on_termination      = "true"
              + encrypted                  = "true"
              + iops                       = (known after apply)
              + throughput                 = (known after apply)
              + volume_initialization_rate = (known after apply)
              + volume_size                = 20
              + volume_type                = "gp3"
            }
        }

      + iam_instance_profile {
          + name = "staging-ec2-app-role"
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = 1
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + monitoring {
          + enabled = true
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Environment" = "staging"
              + "Name"        = "staging-app"
              + "Purpose"     = "application"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Environment" = "staging"
              + "Name"        = "staging-app-volume"
              + "Purpose"     = "application"
            }
        }
    }

  # module.infrastructure.module.ec2_iam_role.aws_iam_instance_profile.this[0] will be created
  + resource "aws_iam_instance_profile" "this" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "staging-ec2-app-role"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "staging-ec2-app-role"
      + tags        = {
          + "Environment" = "staging"
          + "Name"        = "staging-ec2-app-role"
        }
      + tags_all    = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "staging-ec2-app-role"
          + "Project"     = "infrastructure-exercise"
        }
      + unique_id   = (known after apply)
    }

  # module.infrastructure.module.ec2_iam_role.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "staging-ec2-app-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "staging"
          + "Name"        = "staging-ec2-app-role"
        }
      + tags_all              = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "staging-ec2-app-role"
          + "Project"     = "infrastructure-exercise"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.infrastructure.module.ec2_iam_role.aws_iam_role_policy_attachment.this[0] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "staging-ec2-app-role"
    }

  # module.infrastructure.module.ec2_iam_role.aws_iam_role_policy_attachment.this[1] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/CloudWatchAgentServerPolicy"
      + role       = "staging-ec2-app-role"
    }

  # module.infrastructure.module.ec2_iam_role.aws_iam_role_policy_attachment.this[2] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "staging-ec2-app-role"
    }

  # module.infrastructure.module.eks_cluster.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.infrastructure.module.eks_cluster.data.aws_iam_policy_document.vpc_cni_assume_role will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "vpc_cni_assume_role" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = (known after apply)
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:kube-system:aws-node",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.infrastructure.module.eks_cluster.data.tls_certificate.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "cluster" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.infrastructure.module.eks_cluster.aws_cloudwatch_log_group.cluster will be created
  + resource "aws_cloudwatch_log_group" "cluster" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/eks/staging-eks/cluster"
      + name_prefix       = (known after apply)
      + retention_in_days = 90
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "infrastructure-exercise"
        }
      + tags_all          = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "infrastructure-exercise"
        }
    }

  # module.infrastructure.module.eks_cluster.aws_eks_addon.coredns will be created
  + resource "aws_eks_addon" "coredns" {
      + addon_name                  = "coredns"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "staging-eks"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "PRESERVE"
      + tags                        = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "infrastructure-exercise"
        }
      + tags_all                    = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "infrastructure-exercise"
        }
    }

  # module.infrastructure.module.eks_cluster.aws_eks_addon.kube_proxy will be created
  + resource "aws_eks_addon" "kube_proxy" {
      + addon_name                  = "kube-proxy"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "staging-eks"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "PRESERVE"
      + tags                        = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "infrastructure-exercise"
        }
      + tags_all                    = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "infrastructure-exercise"
        }
    }

  # module.infrastructure.module.eks_cluster.aws_eks_addon.vpc_cni will be created
  + resource "aws_eks_addon" "vpc_cni" {
      + addon_name                  = "vpc-cni"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "staging-eks"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "PRESERVE"
      + service_account_role_arn    = (known after apply)
      + tags                        = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "infrastructure-exercise"
        }
      + tags_all                    = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "infrastructure-exercise"
        }
    }

  # module.infrastructure.module.eks_cluster.aws_eks_cluster.this will be created
  + resource "aws_eks_cluster" "this" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + enabled_cluster_log_types     = [
          + "api",
          + "audit",
          + "authenticator",
          + "controllerManager",
          + "scheduler",
        ]
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "staging-eks"
      + platform_version              = (known after apply)
      + role_arn                      = (known after apply)
      + status                        = (known after apply)
      + tags                          = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "infrastructure-exercise"
        }
      + tags_all                      = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "infrastructure-exercise"
        }
      + version                       = "1.31"

      + access_config (known after apply)

      + encryption_config {
          + resources = [
              + "secrets",
            ]

          + provider {
              + key_arn = (known after apply)
            }
        }

      + kubernetes_network_config (known after apply)

      + upgrade_policy (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # module.infrastructure.module.eks_cluster.aws_iam_openid_connect_provider.cluster will be created
  + resource "aws_iam_openid_connect_provider" "cluster" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "infrastructure-exercise"
        }
      + tags_all        = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "infrastructure-exercise"
        }
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # module.infrastructure.module.eks_cluster.aws_iam_role.cluster will be created
  + resource "aws_iam_role" "cluster" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "staging-eks-cluster-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "infrastructure-exercise"
        }
      + tags_all              = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "infrastructure-exercise"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.infrastructure.module.eks_cluster.aws_iam_role.vpc_cni will be created
  + resource "aws_iam_role" "vpc_cni" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "staging-eks-vpc-cni-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "infrastructure-exercise"
        }
      + tags_all              = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "infrastructure-exercise"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.infrastructure.module.eks_cluster.aws_iam_role_policy_attachment.cluster_policy will be created
  + resource "aws_iam_role_policy_attachment" "cluster_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "staging-eks-cluster-role"
    }

  # module.infrastructure.module.eks_cluster.aws_iam_role_policy_attachment.cluster_vpc_resource_controller will be created
  + resource "aws_iam_role_policy_attachment" "cluster_vpc_resource_controller" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = "staging-eks-cluster-role"
    }

  # module.infrastructure.module.eks_cluster.aws_iam_role_policy_attachment.vpc_cni will be created
  + resource "aws_iam_role_policy_attachment" "vpc_cni" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "staging-eks-vpc-cni-role"
    }

  # module.infrastructure.module.eks_cluster.aws_security_group.cluster will be created
  + resource "aws_security_group" "cluster" {
      + arn                    = (known after apply)
      + description            = "Security group for EKS cluster control plane"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "staging-eks-cluster-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "staging-eks-cluster-sg"
          + "Project"     = "infrastructure-exercise"
        }
      + tags_all               = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "staging-eks-cluster-sg"
          + "Project"     = "infrastructure-exercise"
        }
      + vpc_id                 = (known after apply)
    }

  # module.infrastructure.module.eks_cluster.aws_security_group_rule.cluster_egress_to_internet will be created
  + resource "aws_security_group_rule" "cluster_egress_to_internet" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow cluster to communicate with internet for add-ons"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # module.infrastructure.module.eks_node_group.data.aws_ssm_parameter.eks_ami[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ssm_parameter" "eks_ami" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + name           = "/aws/service/eks/optimized-ami/1.31/amazon-linux-2/recommended/image_id"
      + type           = (known after apply)
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.infrastructure.module.eks_node_group.aws_eks_node_group.this will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = (known after apply)
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.medium",
        ]
      + node_group_name        = "staging-nodes"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags                   = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "infrastructure-exercise"
        }
      + tags_all               = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "infrastructure-exercise"
        }
      + version                = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + node_repair_config (known after ap

...(truncated)
```
</details>

> 💰 **Cost estimate:** Check for Infracost comment below